// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

Console.Write("Введите число x: ");
int x = Convert.ToInt32 (Console.ReadLine());
if (x % 2 == 0)
{
    Console.WriteLine("да");
}
else
{
   Console.WriteLine("нет");
}






