// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

int a = Console.ReadLine();
int b = Console.ReadLine();
if a > b
{
    Console.WriteLine("max = {a}");
}
else
{
    Console.WriteLine("max = {b}");
}



